# GetNumberOfBarGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarTrimExtendData..::..GetNumberOfBarGeometry Method
RebarTrimExtendData Class See Also
---
Gets the number of Bar Geometry that were added.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetNumberOfBarGeometry()
```

Visual Basic
---
```text
Public Function GetNumberOfBarGeometry As Integer
```

Visual C++
---
```text
public:
int GetNumberOfBarGeometry()
```

# ### Return Value
Returns the number of Bar Geometry that were added.
# See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace